Autodesk.Revit.DB.Architecture.HandRailType.SupportTypeId
The support type of the handrail.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The supportTypeId is not a valid rail support or invalidElementId.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2013